const books = [
  ['А. Азимов, «Я, робот»',],
  ['С. В. Лукьяненко, «Ночной дозор»',],
  [
    'Д.Р. Толкин, «Хоббит»',
    'Д.Р. Толкин, «Хранители и кольцо»',
    'Д.Р. Толкин, «Две твердыни»',
    'Д.Р. Толкин, «Возвращение короля»',
  ],
  ['А. Н. и Б. Н. Стругацкие, «Обитаемый остров»',],
  ['Рэй Брэдберри, «451 градус по Фаренгейту»',],
  [
    'Д. Симмонс, «Гиперион»',
    'Д. Симмонс, «Закат Гипериона»',
  ],
  ['Р. Желязны, «Девять принцев Амбера»',],
  ['А. Зорич, «Время московское»'],
];
// Получили массив, состоящий из массивов

console.log(books);